[
    {
        "id": 1,
        "title": "Spotify replica",
        "subtitle": "just to train",
        "text": "Made a spotify replica using SCSS to enhance basic CSS possibilities and clearer file management. Used vanilla Javascript to manipulate music with web audio API",
        "imagePath": "/spotify.jpg",
        "pagePath": "spotify-replica",
        "article": {
            "demoPath": "https://benoitpetit.fr/test_creations/spotify_replica/",
            "images": [
                "spotify_1.jpg",
                "spotify_2.jpg",
                "spotify_3.jpg"
            ],
            "text": [
                "Made using HTML & SCSS, this little project allowed me to train myself for frontend applications with interresting layouts such as Spotify.",
                "This layout includes the use of grid to place blocks such as navigation, playbar, and user flow of albums and playlists. Grid feature is used to design responsive design without even touching to media queries.",
                "This training project also was a great way to explore the navigator audio API using a lot of events to catch audio attributes. As well as audio manipulation, I used mouse events to link the audio playbar and music volume to the width of the element."
            ]
        }
    },
    {
        "id": 2,
        "title": "Landing page",
        "subtitle": "group work",
        "text": "Simple landing page with several interresting features such as sliders but also 3D Object and option to change language.",
        "imagePath": "/landing.jpg",
        "pagePath": "landing-page",
        "article": {
            "demoPath": "https://benoitpetit.fr/promo/",
            "images": [
                "landing_1.jpg",
                "landing.jpg",
                "landing_3.jpg"
            ],
            "text": [
                "This project is a landing page for an online game card I used it to develop big features such as a slider and a 3D Object.",
                "This slider was made using SwiperJS (instead of the first slider which is done in vanilla Javascript with the help of GSAP)I learned how to put in place this librairy which is really easy and also works on mobile.",
                "To promote the game, we thought we could include a 3D model of the box. So I've implemented it using ThreeJS, which makes it really easy to do that kind of stuff."
            ]
        }
    },
    {
        "id": 3,
        "title": "Login system",
        "subtitle": "just to train",
        "text": "Made a complete login system + Google login using MySQL database and PHP to make requests. Also using jQuery AJAX to notify the user from errors.",
        "imagePath": "/login.jpg",
        "pagePath": "login-system",
        "article": {
            "demoPath": "https://benoitpetit.fr/test_creations/google_login/",
            "images": [
                "login_1.jpg",
                "login_2.jpg",
                "login_3.jpg"
            ],
            "text": [
                "Made with standard technologies such as HTML/CSS + jQuery & PHP. This project was made to train myself, to challenge myself about login system as well as understanding the Google login API.",
                "A big part of that project was to send live responses to the user for a good UX.This was made by sending async requests with AJAX (simplified by jQuery). Same story on the \"sign in\" side with cool UI cards to prevent from errors.",
                "This personal project also was a great way to deal with the google login feature which in my case I use a lot to buy time. So i thought this would be a great opportunity to implement that to learn more about the functioning system behind that simple button."
            ]
        }
    }
]
