[
  {
    "id": 1,
    "title": "Fatale Mascarade",
    "subtitle": "group work",
    "text": "Hybrid game mixing physical cards and web application. Made with React and NodeJS with Socket.io for the live interactions between players.",
    "imagePath": "/fatale-mascarade.jpg",
    "pagePath": "fatale-mascarade",
    "article": {
      "demoPath": "https://fatale-mascarade.vercel.app/",
      "images": [
        "fatale-mascarade.jpg",
        "fatale-mascarade_1.jpg",
        "fatale-mascarade_2.jpg",
        "fatale-mascarade_3.jpg"
      ],
      "text": [
        "Made using React backed with a NodeJS server with Socket.io for the live interactions between players.",
        "This is a group project in which I was the only developer and my partner was the designer. This was the first time I have ever used Socket.io",
        "This is an hybrid game with physical cards and the application (preferably played on mobile phone). Every played has an attributed role and must find who is the killer. Players must find clues and discuss to find the killer. The game is played in 5 rounds."
      ]
    }
  },
  {
    "id": 2,
    "title": "Turbo Bechamel",
    "subtitle": "group work",
    "text": "Project finished in 3 days for a Game Jam. The words we had were : \"Action\", \"Vin Diesel\", \"Lasagnas\" and \"Grandmother\".",
    "imagePath": "/turbo-bechamel.jpg",
    "pagePath": "turbo-bechamel",
    "article": {
      "demoPath": "https://turbo-bechamel.vercel.app/",
      "images": [
        "turbo-bechamel_1.jpg",
        "turbo-bechamel_2.jpg",
        "turbo-bechamel_3.jpg"
      ],
      "text": [
        "This project is from a Game Jam in which we had to make a game in 3 days.",
        "The mandatory words we had to put in the game were : \"Action\", \"Vin Diesel\", \"Lasagnas\" and \"Grandmother\".",
        "We made a game where you play as Vin Diesel who has to make lasagnas to feed the car and make it go faster. You are chased by your grandmother who wants the recipe of the lasagnas. You have to avoid her and make the lasagnas to win the game."
      ]
    }
  },
  {
    "id": 3,
    "title": "Neolympics",
    "subtitle": "group work",
    "text": "3D skate game about new olympic sports made with Vue and Three.js",
    "imagePath": "/neolympics.jpg",
    "pagePath": "neolympics",
    "article": {
      "demoPath": "https://neolympics.vercel.app/",
      "images": [
        "neolympics.jpg",
        "neolympics_2.jpg",
        "neolympics_3.jpg",
        "neolympics_4.jpg",
        "neolympics_5.jpg",
        "neolympics_6.jpg"
      ],
      "text": [
        "This project is a 3D skate game about new olympic sports.",
        "The imposed theme was The Olympics. We decided to make a game about new olympic sports in Paris 2024 such as skateboarding, breakdancing, surfing. We prioritized skateboarding.",
        "The game is a skate game where you have to do tricks like a pattern to get the most points."
      ]
    }
  },
  {
    "id": 4,
    "title": "Seeet",
    "subtitle": "just to train",
    "text": "Little game in which you have to make Seeets powered by Tauri to have it desktop app",
    "imagePath": "/seeet.jpg",
    "pagePath": "seeet",
    "article": {
      "demoPath": "https://github.com/benbenpetit/Seeet",
      "images": ["seeet.jpg", "seeet_2.jpg", "seeet_3.jpg"],
      "text": [
        "This is an existing game, I just copied it to be able to play it on my computer.",
        "In the game, certain combinations of three cards are said to make up a \"set\". For each one of the four categories of features—color, number, shape, and shading—the three cards must display that feature as either all the same, or all different.",
        "I made this game to train myself and to have a desktop app made with Tauri."
      ]
    }
  },
  {
    "id": 5,
    "title": "Creations",
    "subtitle": "just to train",
    "text": "Some of randoms tests I made to experiment",
    "imagePath": "/benbenpetit.gif",
    "pagePath": "creations",
    "article": {
      "isTests": true,
      "images": ["benbenpetit.gif"],
      "text": [
        "Some tests I made.",
        "These are all the little experimental websites or ideas I put in place while I was searching for ideas, or when I wanted to copy effects I saw on some websites, or when I was bored."
      ]
    }
  }
]
